#include "stdafx.h"
#include "Example001.h"
#include "Example002.h"
#include "Example003.h"
#include "Example004.h"
//=============================================================================
#if defined(_MSC_VER)
#	pragma comment( lib, "3rdparty.lib" )
#	pragma comment( lib, "Engine.lib" )
#endif
//=============================================================================
int main(
	[[maybe_unused]] int   argc,
	[[maybe_unused]] char* argv[])
{
	//----------------------------------------------------------------------------
	// Вывод треугольника на основную поверхность
	// - вершинный буфер из позиции и цвета
	// - индексный буфер
	// - создание GraphicsPipeline
	//Example001 game;
	
	//----------------------------------------------------------------------------
	// Вывод прямоугольника с текстурой на основную поверхность
	// - текстура
	// - семплер
	//Example002 game;
	
	//----------------------------------------------------------------------------
	// Вывод прямоугольника с текстурой на основную поверхность с матрицами трансформации
	// - юниформ буфер и MVP матрицы
	//Example003 game;

	//----------------------------------------------------------------------------

	Example004 game;

	game.Run();
}
//=============================================================================