#include "stdafx.h"
#include "Example001.h"
#include "Example002.h"
#include "Example003.h"
#include "Example004.h"
#include "Example005.h"
#include "Example006.h"
#include "Example007.h"
//=============================================================================
#if defined(_MSC_VER)
#	pragma comment( lib, "3rdparty.lib" )
#	pragma comment( lib, "Engine.lib" )
#endif
//=============================================================================
int main(
	[[maybe_unused]] int   argc,
	[[maybe_unused]] char* argv[])
{
	//----------------------------------------------------------------------------
	// Вывод треугольника на основную поверхность
	// - вершинный буфер из позиции и цвета
	// - индексный буфер
	// - создание GraphicsPipeline
	//Example001 game;
	
	//----------------------------------------------------------------------------
	// Вывод прямоугольника с текстурой на основную поверхность
	// - текстура
	// - семплер
	//Example002 game;
	
	//----------------------------------------------------------------------------
	// Вывод прямоугольника с текстурой на основную поверхность с матрицами трансформации
	// - юниформ буфер и MVP матрицы
	//Example003 game;

	//----------------------------------------------------------------------------
	// Вывод кубов на сцену и движение по ней с помощью камеры
	// - вывод кубов. куб с нормалью
	// - включения Z буфера
	// - Camera
	//Example004 game;

	//----------------------------------------------------------------------------
	// Вывод кубов на сцену с освещением (блин-фонг)
	//Example005 game;

	//----------------------------------------------------------------------------
	// Вывод кубов на сцену с освещением (блин-фонг) и текстурами
	//Example006 game;

	//----------------------------------------------------------------------------
	// Вывод кубов на сцену с несколькими источниками света разных типов
	Example007 game;




	game.Run();
}
//=============================================================================